Terstegge/mbed-os-MSP432/TICloudAgent/loaders/ccs_base/common/targetdb/Modules/MSP432/EUSCI_B_356.0.xml
    <register id="UCBCTLW1" width="16" offset="0x2" internal="0" description="eUSCI_Bx Control Word Register 1">
        <bitfield id="UCGLIT" description="Deglitch time" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="UCGLIT_0" value="0x0" description="50 ns"/>
            <bitenum id="UCGLIT_1" value="0x1" description="25 ns"/>
            <bitenum id="UCGLIT_2" value="0x2" description="12.5 ns"/>
            <bitenum id="UCGLIT_3" value="0x3" description="6.25 ns"/>
        </bitfield>
        <bitfield id="UCASTP" description="Automatic STOP condition generation" begin="3" end="2" width="2" rwaccess="R/W">
            <bitenum id="UCASTP_0" value="0x0" description="No automatic STOP generation. The STOP condition is generated after the user sets the UCTXSTP bit. The value in UCBxTBCNT is a don't care."/>
            <bitenum id="UCASTP_1" value="0x1" description="UCBCNTIFG is set with the byte counter reaches the threshold defined in UCBxTBCNT"/>
            <bitenum id="UCASTP_2" value="0x2" description="A STOP condition is generated automatically after the byte counter value reached UCBxTBCNT. UCBCNTIFG is set with the byte counter reaching the threshold"/>
        </bitfield>
        <bitfield id="UCSWACK" description="SW or HW ACK control" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="UCSWACK_0" value="0x0" description="The address acknowledge of the slave is controlled by the eUSCI_B module"/>
            <bitenum id="UCSWACK_1" value="0x1" description="The user needs to trigger the sending of the address ACK by issuing UCTXACK"/>
        </bitfield>
        <bitfield id="UCSTPNACK" description="ACK all master bytes" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCSTPNACK_0" value="0x0" description="Send a non-acknowledge before the STOP condition as a master receiver (conform to I2C standard)"/>
            <bitenum id="UCSTPNACK_1" value="0x1" description="All bytes are acknowledged by the eUSCI_B when configured as master receiver"/>
        </bitfield>
        <bitfield id="UCCLTO" description="Clock low timeout select" begin="7" end="6" width="2" rwaccess="R/W">
            <bitenum id="UCCLTO_0" value="0x0" description="Disable clock low timeout counter"/>
            <bitenum id="UCCLTO_1" value="0x1" description="135 000 SYSCLK cycles (approximately 28 ms)"/>
            <bitenum id="UCCLTO_2" value="0x2" description="150 000 SYSCLK cycles (approximately 31 ms)"/>
            <bitenum id="UCCLTO_3" value="0x3" description="165 000 SYSCLK cycles (approximately 34 ms)"/>
        </bitfield>
        <bitfield id="UCETXINT" description="Early UCTXIFG0" begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="UCETXINT_0" value="0x0" description="UCTXIFGx is set after an address match with UCxI2COAx and the direction bit indicating slave transmit"/>
            <bitenum id="UCETXINT_1" value="0x1" description="UCTXIFG0 is set for each START condition"/>
        </bitfield>
    </register>
    <register id="UCBBRW" width="16" offset="0x6" internal="0" description="eUSCI_Bx Baud Rate Control Word Register">
    </register>
    <register id="UCBBRW_SPI" width="16" offset="0x6" internal="0" description="eUSCI_Bx Bit Rate Control Register 1">
    </register>
    <register id="UCBSTATW" width="16" offset="0x8" internal="0" description="eUSCI_Bx Status Register">
        <bitfield id="UCBBUSY" description="Bus busy" begin="4" end="4" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="Bus inactive"/>
            <bitenum id="BUSY" value="0x1" description="Bus busy"/>
        </bitfield>
        <bitfield id="UCGC" description="General call address received" begin="5" end="5" width="1" rwaccess="R">
            <bitenum id="UCGC_0" value="0x0" description="No general call address received"/>
            <bitenum id="UCGC_1" value="0x1" description="General call address received"/>
        </bitfield>
        <bitfield id="UCSCLLOW" description="SCL low" begin="6" end="6" width="1" rwaccess="R">
            <bitenum id="UCSCLLOW_0" value="0x0" description="SCL is not held low"/>
            <bitenum id="UCSCLLOW_1" value="0x1" description="SCL is held low"/>
        </bitfield>
        <bitfield id="UCBCNT" description="Hardware byte counter value" begin="15" end="8" width="8" rwaccess="R">
        </bitfield>
    </register>
    <register id="UCBSTATW_SPI" width="16" offset="0x8" internal="0" description="">
        <bitfield id="UCBUSY" description="eUSCI_B busy" begin="0" end="0" width="1" rwaccess="R">
            <bitenum id="IDLE" value="0x0" description="eUSCI_B inactive"/>
            <bitenum id="BUSY" value="0x1" description="eUSCI_B transmitting or receiving"/>
        </bitfield>
        <bitfield id="UCOE" description="Overrun error flag" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="UCOE_0" value="0x0" description="No error"/>
            <bitenum id="UCOE_1" value="0x1" description="Overrun error occurred"/>
        </bitfield>
        <bitfield id="UCFE" description="Framing error flag" begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="UCFE_0" value="0x0" description="No error"/>
            <bitenum id="UCFE_1" value="0x1" description="Bus conflict occurred"/>
        </bitfield>
        <bitfield id="UCLISTEN" description="Listen enable" begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="UCLISTEN_0" value="0x0" description="Disabled"/>
            <bitenum id="UCLISTEN_1" value="0x1" description="Enabled. UCBxTXD is internally fed back to the receiver"/>
        </bitfield>
    </register>
    <register id="UCBTBCNT" width="16" offset="0xA" internal="0" description="eUSCI_Bx Byte Counter Threshold Register">
        <bitfield id="UCTBCNT" description="Byte counter threshold value" begin="7" end="0" width="8" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="UCBRXBUF" width="16" offset="0xC" internal="0" description="eUSCI_Bx Receive Buffer Register">
        <bitfield id="UCRXBUF" description="Receive data buffer" begin="7" end="0" width="8" rwaccess="R">
        </bitfield>
    </register>
